In [2]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
import numpy as np

In [2]:
raw_alcohol = pd.read_sas('ALQ_I.XPT')

columns to keep:

ALQ130 - Avg # alcoholic drinks/day - past 12 mos (discrete)

ALQ151 - Ever have 4/5 or more drinks every day? (categorical)

In [7]:
alcohol_cols_to_keep = ['SEQN', 'ALQ130', 'ALQ151']

In [8]:
alcohol_df = raw_alcohol[alcohol_cols_to_keep]

In [9]:
alcohol_df.shape

(5735, 3)

In [10]:
alcohol_df.isna().sum()

SEQN         0
ALQ130    2356
ALQ151    1513
dtype: int64

In [11]:
alcohol_df.loc[alcohol_df['ALQ130'] > 666,'ALQ130'] = np.NaN
alcohol_df.loc[alcohol_df['ALQ151'] > 6,'ALQ151'] = np.NaN

In [12]:
alcohol_df.isna().sum()

SEQN         0
ALQ130    2360
ALQ151    1515
dtype: int64

In [13]:
alcohol_df.head()

      SEQN  ALQ130  ALQ151
0  83732.0     1.0     2.0
1  83733.0     6.0     1.0
2  83734.0     NaN     1.0
3  83735.0     1.0     2.0
4  83736.0     1.0     2.0

In [14]:
alcohol_df.rename(columns={'ALQ130':'Avg_Num_Alcohol_Drink_a_Day','ALQ151':'Have_4_5_Plus_Drinks_a_Day'}, inplace=True)

In [15]:
alcohol_df.head()

      SEQN  Avg_Num_Alcohol_Drink_a_Day  Have_4_5_Plus_Drinks_a_Day
0  83732.0                          1.0                         2.0
1  83733.0                          6.0                         1.0
2  83734.0                          NaN                         1.0
3  83735.0                          1.0                         2.0
4  83736.0                          1.0                         2.0

In [16]:
alcohol_df.shape

(5735, 3)

In [18]:
alcohol_df.to_csv('Alcohol_Use_Questionnaire_Data.csv')

In [3]:
alc_df = pd.read_csv('Alcohol_Use_Questionnaire_Data.csv', index_col=0)

In [4]:
alc_df.head()

      SEQN  Avg_Num_Alcohol_Drink_a_Day  Have_4_5_Plus_Drinks_a_Day
0  83732.0                          1.0                         2.0
1  83733.0                          6.0                         1.0
2  83734.0                          NaN                         1.0
3  83735.0                          1.0                         2.0
4  83736.0                          1.0                         2.0

In [5]:
alc_df['Have_4_5_Plus_Drinks_a_Day'].value_counts()

2.0    3495
1.0     725
Name: Have_4_5_Plus_Drinks_a_Day, dtype: int64